app/Controllers/Admin/Login.php

    private function loginMe($email,$password){
        $table = DB()->table('cc_users');
        $user = $table->where('email',$email)->where('status','1')->get()->getRow();
---
SELECT *
FROM `users`
WHERE `email` = 'admin@gmail.com'
AND `status` = '1'