app/Controllers/Admin/Product_category.php

    public function index()
    {
        $isLoggedInEcAdmin = $this->session->isLoggedInEcAdmin;
        $adRoleId = $this->session->adRoleId;
        if (!isset($isLoggedInEcAdmin) || $isLoggedInEcAdmin != TRUE) {
            return redirect()->to(site_url('Admin/Login'));
        } else {

            $table = DB()->table('product_category');
            $data['category'] = $table->get()->getResult();
---
SELECT *
FROM `product_category`