app/Helpers/Global_helper.php

function admin_user_name(){
    $userId = newSession()->adUserId;
    $table = DB()->table('users');
    $query = $table->where('user_id',$userId)->get()->getRow()->name;
---
SELECT *
FROM `users`
WHERE `user_id` = '1'