app/Libraries/Permission.php

    public function have_access($roleId, $module_name, $sub_permission){
        $table = DB()->table('cc_roles');
        $result = $table->where('role_id',$roleId)->get()->getRow();
---
SELECT *
FROM `roles`
WHERE `role_id` = '1'

    public function module_permission_list($role_id, $module_name){
        $table = DB()->table('cc_roles');
        $result = $table->where('role_id',$role_id)->get()->getRow();
---
SELECT *
FROM `roles`
WHERE `role_id` = '1'